Reports/ИА_ЗаказНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Report>
		<Properties>
			<Name>ИА_ЗаказНаПриобретение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/ИА_СредстваВРезервеНаФондах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<AccumulationRegister>
		<Properties>
			<Name>ИА_СредстваВРезервеНаФондах</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СуммаНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗП</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/КСУ_ЛентаСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КСУ_ЛентаСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Детали</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПериодСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ИА_ЗакрытиеЗаказаНаПриобретение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ИА_ЗакрытиеЗаказаНаПриобретение</Name>
			<BasedOn>
				<xr:Item>Document.ИА_ЗаказНаПриобретение</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ИА_СредстваНаФондах</xr:Item>
				<xr:Item>AccumulationRegister.ИА_СредстваВРезервеНаФондах</xr:Item>
				<xr:Item>InformationRegister.ИА_ИсторияСтатусовЗВС</xr:Item>
				<xr:Item>AccumulationRegister.ИА_ЗаказыНаПриобретение</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРезерваНал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРезерваБезнал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаказОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИА_ЗаказНаПриобретение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СнятьРезерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВеб</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВернутьНаФонды</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_ЦФО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Фонд</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИА_Фонды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ИА_ЗаказНаПриобретение/Ext/ObjectModule.bsl
Функция Печать() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(Обороты.СуммаБезналПриход) КАК Одобрено,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение
		|				ТОГДА 0
		|			ИНАЧЕ Обороты.СуммаБезналРасход
		|		КОНЕЦ) КАК Выплачено,
		|	СУММА(ВЫБОР
		|			КОГДА Обороты.Регистратор ССЫЛКА Документ.ИА_ЗакрытиеЗаказаНаПриобретение
		|				ТОГДА Обороты.СуммаБезналРасход
		|			ИНАЧЕ 0
		|		КОНЕЦ) КАК Закрыто,
		|	ЕСТЬNULL(ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток, 0) КАК ОсталосьВыплатить
		|ИЗ
		|	РегистрНакопления.ИА_СредстваВРезервеНаФондах.Обороты(, , Регистратор, ЗП = &ЗП) КАК Обороты
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ИА_СредстваВРезервеНаФондах.Остатки КАК ИА_СредстваВРезервеНаФондахОстатки
		|		ПО Обороты.ЗП = ИА_СредстваВРезервеНаФондахОстатки.ЗП
		|
		|СГРУППИРОВАТЬ ПО
		|	ИА_СредстваВРезервеНаФондахОстатки.СуммаБезналОстаток";

	Запрос.УстановитьПараметр("ЗП",СсылкаНаОбъект);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Одобрено = 0;
	Выплачено = 0;
	Если выборка.Следующий() Тогда
		Одобрено = выборка.Одобрено;		
		Выплачено = выборка.Выплачено;
	КонецЕсли;
	
	Структура = ИА_ФП.ВернутьСтатусЗВС(СсылкаНаОбъект);
	
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ЗаявкаНаРасходованиеСредств_ЗаказНаПриобретение";
	
	Макет = ПолучитьМакет("ЗаказНаПриобретение");
	
	Область = Макет.ПолучитьОбласть("ШапкаЗаявки");
	ЗаполнитьЗначенияСвойств(Область.Параметры, СсылкаНаОбъект); 
	Область.Параметры.ПредметЗаказа = ВРЕГ(СсылкаНаОбъект.ПредметЗаказа);
	Область.Параметры.ДатаПечати = "Печатная форма сформирована " + ТекущаяДата();
	Область.Параметры.Статус = Структура.Статус;
	Область.Параметры.Дата = формат(СсылкаНаОбъект.дата,"ДФ=dd.MM.yyyy");
	Область.Параметры.Сумма = формат(СсылкаНаОбъект.Сумма,"ЧДЦ=2; ЧН=") + " руб.";
	Область.Параметры.Одобрено = формат(Одобрено,"ЧДЦ=2; ЧН=") + " руб.";
	Область.Параметры.Выплачено = формат(Выплачено,"ЧДЦ=2; ЧН=") + " руб.";
	ТабДокумент.Вывести(Область);
	
	ВывестиБлок("Ситуация",Макет,ТабДокумент,СсылкаНаОбъект);
	ВывестиБлок("Данные",Макет,ТабДокумент,СсылкаНаОбъект);
	ВывестиБлок("Решение",Макет,ТабДокумент,СсылкаНаОбъект);
	
	Область = Макет.ПолучитьОбласть("ФайлыШапка");
	ТабДокумент.Вывести(Область);
	Для каждого стр из СсылкаНаОбъект.Файлы Цикл
		Область = Макет.ПолучитьОбласть("ФайлыСтрока");
		ЗаполнитьЗначенияСвойств(Область.Параметры, стр); 
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	Область = Макет.ПолучитьОбласть("ПодвалЗаявки");
	ТабДокумент.Вывести(Область);
	
	ЗапросЛенты = новый запрос;
	ЗапросЛенты.Текст = "ВЫБРАТЬ
	                    |	КСУ_ЛентаСобытий.ПериодСобытия КАК Период,
	                    |	КСУ_ЛентаСобытий.Событие КАК Событие,
	                    |	КСУ_ЛентаСобытий.Ответственный КАК Ответственный
	                    |ИЗ
	                    |	РегистрСведений.КСУ_ЛентаСобытий КАК КСУ_ЛентаСобытий
	                    |ГДЕ
	                    |	КСУ_ЛентаСобытий.Объект = &Объект
	                    |
	                    |УПОРЯДОЧИТЬ ПО
	                    |	Период УБЫВ";
	ЗапросЛенты.УстановитьПараметр("Объект", СсылкаНаОбъект);
	
	Область = Макет.ПолучитьОбласть("ШапкаЛента");
	ТабДокумент.Вывести(Область);
	
	Выборка = ЗапросЛенты.Выполнить().Выбрать();
	Пока выборка.Следующий() Цикл
		Область = Макет.ПолучитьОбласть("Лента");
		ЗаполнитьЗначенияСвойств(Область.Параметры, Выборка); 
		ТабДокумент.Вывести(Область);
	КонецЦикла;
	
	ТабДокумент.АвтоМасштаб = истина;
	ТабДокумент.ОриентацияСтраницы=ОриентацияСтраницы.Портрет;
	ТабДокумент.ОтображатьСетку = ложь;
	ТабДокумент.ОтображатьГруппировки = ложь;
	
	Возврат ТабДокумент;
	
КонецФункции

Процедура ВывестиБлок(ИмяБлока,Макет,ТабДокумент,СсылкаНаОбъект)
	ТекстБлока = СсылкаНаОбъект[ИмяБлока];
	Область = Макет.ПолучитьОбласть("Шапка" + ИмяБлока);
	Область.Параметры[ИмяБлока] = ТекстБлока;
	Если ТабДокумент.ПроверитьВывод(Область) Тогда 
		ТабДокумент.Вывести(Область);
	Иначе
		МассивСлов = ВернутьМассивСлов(ТекстБлока);
		ПоэтапныйВыводСлов(ТабДокумент,Макет,Область,МассивСлов,ИмяБлока,"Строка" + ИмяБлока);
	КонецЕсли;
КонецПроцедуры

Функция ВернутьМассивСлов(ИсходныйТекст)
	КолВо = СтрДлина(ИсходныйТекст);
	Слово = "";
	МассивСлов = Новый Массив;
	Для Сч = 1 По КолВо Цикл
		Буква = Сред(ИсходныйТекст,Сч,1);
		Если ЗначениеЗаполнено(Буква) Тогда 
			Слово = Слово + Буква;
		Иначе
			Если Слово <> "" Тогда
				МассивСлов.Добавить(Слово);
				Слово = "";
				МассивСлов.Добавить(Буква);//Добавляем пустые символы как отдельные слова
			Иначе
				МассивСлов.Добавить(Буква);//Добавляем пустые символы как отдельные слова
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Если Слово <> "" Тогда
		МассивСлов.Добавить(Слово);
	КонецЕсли;
	Возврат МассивСлов;
КонецФункции

Процедура ПоэтапныйВыводСлов(ТабДокумент,Макет,Область,МассивСлов,ИмяБлока,ИмяОбластиСтроки)
	ВремТекст = "";
	Для Каждого Эл Из МассивСлов Цикл
		Область.Параметры[ИмяБлока] = ВремТекст + Эл;
		Если НЕ ТабДокумент.ПроверитьВывод(Область) Тогда
			Область.Параметры[ИмяБлока] = ВремТекст;
			ТабДокумент.Вывести(Область);
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			Область = Макет.ПолучитьОбласть(ИмяОбластиСтроки);
			ВремТекст = Эл;
		Иначе
			ВремТекст = ВремТекст + Эл;
		КонецЕсли;
	КонецЦикла;
	Область.Параметры[ИмяБлока] = ВремТекст;
	ТабДокумент.Вывести(Область);
КонецПроцедуры
